from task import Trie, build_trie

def clean_text_simple(text):
    allowed_chars = "абвгдеєжзийклмнопрстуфхцчшщьюяіїґabcdefghijklmnopqrstuvwxyz0123456789 -’'"
    cleaned = []
    for ch in text.lower():
        if ch in allowed_chars:
            cleaned.append(ch)
    return "".join(cleaned)

suspicious_phrases = [
    "застосунок, що підбирає екскурсії",
    "знижка новим користувачам",
    "подруга скинула мені посилання",
    "орендувати віллу без посередників",
    "сервіс виявився кращим за booking",
    "підтримка українською",
    "знайома порадила мені один комплекс вітамінів",
    "реально стало легше вставати",
    "все натуральне, без хімії",
    "порада з форуму",
    "холодні душі вранці плюс крем із cbd-олію",
    "фітнес-тренер",
    "огляд на youtube про нову модель навушників",
    "шумопоглинання ідеальне, заряд тримає тиждень",
    "колега з роботи порадив мені один мобільний додаток",
    "безкоштовна версія — більш ніж достатньо",
    "побачив у стрічці instagram рекламу онлайн-курсу",
    "курс за 4 тижні настільки змінив моє ставлення",
    "друг написав, що проходить марафон з англійської",
    "зламав мовний бар’єр",
    "знайома скинула мені посилання на магазин здорової їжі",
    "снеки, що навіть діти замість чипсів просять",
    "кавомашини — це дорого",
    "друг не показав модель, яку він взяв на розпродажі",
    "кожен ранок починається як у кафе",
    "побачив у tiktok як блогер тестував новий рюкзак",
    "водонепроникний, із зарядкою від сонця",
    "порадили один сервіс для оренди одягу",
    "взяв костюм на весілля — і він виглядав на всі гроші",
    "коштувало копійки"
]

with open("ad.txt", "r", encoding="utf-8") as f:
    text = f.read()

cleaned_text = clean_text_simple(text)
cleaned_phrases = [clean_text_simple(p) for p in suspicious_phrases]

trie = build_trie(cleaned_phrases)
results = trie.search_in_text(cleaned_text)


print("Реклама")
for phrase in cleaned_phrases:
    if phrase in results:
        print(f"Фраза: '{phrase}' знайдена на позиціях: {results[phrase]}")
    else:
        print(f"Фраза: '{phrase}' — не знайдена.")
